repair-pdf.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 13:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>修复pdf文件</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
<p class="date">Published: </p>
</div>
<div id="content">
<h1 class="title">修复pdf文件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org727c68a">1. 页码</a></li>
<li><a href="#org7a7367a">2. 批量更新书签</a></li>
</ul>
</div>
</div>


<div id="outline-container-org727c68a" class="outline-2">
<h2 id="org727c68a"><span class="section-number-2">1</span> 页码</h2>
<div class="outline-text-2" id="text-1">
<p>
比如在 pdf 阅读器里显示 Cover，以及 i，ii，iii，iv 等罗马数字。</p>

<pre class="example">
/PageLabels &lt;&lt; /Nums [
0 &lt;&lt; /P (cover) &gt;&gt; % labels 1st page with the string "cover"
1 &lt;&lt; /S /r &gt;&gt; % numbers pages 2-6 in small roman numerals
6 &lt;&lt; /S /D &gt;&gt; % numbers pages 7-x in decimal arabic numerals
]
&gt;&gt;
</pre>
<p>
引用自： <a href="http://askubuntu.com/questions/32048/renumber-pages-of-a-pdf">http://askubuntu.com/questions/32048/renumber-pages-of-a-pdf</a>
</p>
</div>
</div>

<div id="outline-container-org7a7367a" class="outline-2">
<h2 id="org7a7367a"><span class="section-number-2">2</span> 批量更新书签</h2>
<div class="outline-text-2" id="text-2">
<p>
要用到 pdftk 这个命令行工具，实在太方便了。</p>

<p>
首先要导出 metadata：</p>

<pre class="example">
pdftk test.pdf dump_data &gt; test.info
</pre>

<p>
然后编辑导出的元数据文件 test.info，对每一条书签记录，增加类似如下的4行文字：</p>

<pre class="example">
BookmarkBegin
BookmarkTitle: You're busy. What's the least you can read?
BookmarkLevel: 3
BookmarkPageNumber: 7
</pre>

<p>
上面的文字里的第一行是固定的；第二行表示标题；第三行层次；第四行页码。</p>

<p>
更新完之后，就用 pdftk 的 update<sub>info</sub> 命令来组合原有的 pdf 文件和元数据，以生成新的 pdf 文件：</p>

<pre class="example">
pdftk test.pdf update_info test.info output test2.pdf verbose
</pre>

<p>
参考了：<a href="http://unix.stackexchange.com/questions/17065/add-and-edit-bookmarks-to-pdf">http://unix.stackexchange.com/questions/17065/add-and-edit-bookmarks-to-pdf</a></p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>